MikroElektronika/core_packages/PIC/XC8/def/PIC16F15345/mcu.h
extern volatile PCON0bits_t PCON0bits __at(0x813);
// bitfield macros
#define _PCON0_nBOR_POSN                                    0x0
#define _PCON0_nBOR_POSITION                                0x0
#define _PCON0_nBOR_SIZE                                    0x1
#define _PCON0_nBOR_LENGTH                                  0x1
#define _PCON0_nBOR_MASK                                    0x1
#define _PCON0_nPOR_POSN                                    0x1
#define _PCON0_nPOR_POSITION                                0x1
#define _PCON0_nPOR_SIZE                                    0x1
#define _PCON0_nPOR_LENGTH                                  0x1
#define _PCON0_nPOR_MASK                                    0x2
#define _PCON0_nRI_POSN                                     0x2
#define _PCON0_nRI_POSITION                                 0x2
#define _PCON0_nRI_SIZE                                     0x1
#define _PCON0_nRI_LENGTH                                   0x1
#define _PCON0_nRI_MASK                                     0x4
#define _PCON0_nRMCLR_POSN                                  0x3
#define _PCON0_nRMCLR_POSITION                              0x3
#define _PCON0_nRMCLR_SIZE                                  0x1
#define _PCON0_nRMCLR_LENGTH                                0x1
#define _PCON0_nRMCLR_MASK                                  0x8
#define _PCON0_nRWDT_POSN                                   0x4
#define _PCON0_nRWDT_POSITION                               0x4
#define _PCON0_nRWDT_SIZE                                   0x1
#define _PCON0_nRWDT_LENGTH                                 0x1
#define _PCON0_nRWDT_MASK                                   0x10
#define _PCON0_nWDTWV_POSN                                  0x5
#define _PCON0_nWDTWV_POSITION                              0x5
#define _PCON0_nWDTWV_SIZE                                  0x1
#define _PCON0_nWDTWV_LENGTH                                0x1
#define _PCON0_nWDTWV_MASK                                  0x20
#define _PCON0_STKUNF_POSN                                  0x6
#define _PCON0_STKUNF_POSITION                              0x6
#define _PCON0_STKUNF_SIZE                                  0x1
#define _PCON0_STKUNF_LENGTH                                0x1
#define _PCON0_STKUNF_MASK                                  0x40
#define _PCON0_STKOVF_POSN                                  0x7
#define _PCON0_STKOVF_POSITION                              0x7
#define _PCON0_STKOVF_SIZE                                  0x1
#define _PCON0_STKOVF_LENGTH                                0x1
#define _PCON0_STKOVF_MASK                                  0x80

// Register: PCON1
#define PCON1 PCON1
extern volatile unsigned char           PCON1               __at(0x814);
#ifndef _LIB_BUILD
asm("PCON1 equ 0814h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned nMEMV                  :1;
    };
} PCON1bits_t;
extern volatile PCON1bits_t PCON1bits __at(0x814);
// bitfield macros
#define _PCON1_nMEMV_POSN                                   0x1
#define _PCON1_nMEMV_POSITION                               0x1
#define _PCON1_nMEMV_SIZE                                   0x1
#define _PCON1_nMEMV_LENGTH                                 0x1
#define _PCON1_nMEMV_MASK                                   0x2

// Register: NVMADR
#define NVMADR NVMADR
extern volatile unsigned short          NVMADR              __at(0x81A);
#ifndef _LIB_BUILD
asm("NVMADR equ 081Ah");
#endif

// Register: NVMADRL
#define NVMADRL NVMADRL
extern volatile unsigned char           NVMADRL             __at(0x81A);
#ifndef _LIB_BUILD
asm("NVMADRL equ 081Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMADRL0               :1;
        unsigned NVMADRL1               :1;
        unsigned NVMADRL2               :1;
        unsigned NVMADRL3               :1;
        unsigned NVMADRL4               :1;
        unsigned NVMADRL5               :1;
        unsigned NVMADRL6               :1;
        unsigned NVMADRL7               :1;
    };
} NVMADRLbits_t;
extern volatile NVMADRLbits_t NVMADRLbits __at(0x81A);
// bitfield macros
#define _NVMADRL_NVMADRL0_POSN                              0x0
#define _NVMADRL_NVMADRL0_POSITION                          0x0
#define _NVMADRL_NVMADRL0_SIZE                              0x1
#define _NVMADRL_NVMADRL0_LENGTH                            0x1
#define _NVMADRL_NVMADRL0_MASK                              0x1
#define _NVMADRL_NVMADRL1_POSN                              0x1
#define _NVMADRL_NVMADRL1_POSITION                          0x1
#define _NVMADRL_NVMADRL1_SIZE                              0x1
#define _NVMADRL_NVMADRL1_LENGTH                            0x1
#define _NVMADRL_NVMADRL1_MASK                              0x2
#define _NVMADRL_NVMADRL2_POSN                              0x2
#define _NVMADRL_NVMADRL2_POSITION                          0x2
#define _NVMADRL_NVMADRL2_SIZE                              0x1
#define _NVMADRL_NVMADRL2_LENGTH                            0x1
#define _NVMADRL_NVMADRL2_MASK                              0x4
#define _NVMADRL_NVMADRL3_POSN                              0x3
#define _NVMADRL_NVMADRL3_POSITION                          0x3
#define _NVMADRL_NVMADRL3_SIZE                              0x1
#define _NVMADRL_NVMADRL3_LENGTH                            0x1
#define _NVMADRL_NVMADRL3_MASK                              0x8
#define _NVMADRL_NVMADRL4_POSN                              0x4
#define _NVMADRL_NVMADRL4_POSITION                          0x4
#define _NVMADRL_NVMADRL4_SIZE                              0x1
#define _NVMADRL_NVMADRL4_LENGTH                            0x1
#define _NVMADRL_NVMADRL4_MASK                              0x10
#define _NVMADRL_NVMADRL5_POSN                              0x5
#define _NVMADRL_NVMADRL5_POSITION                          0x5
#define _NVMADRL_NVMADRL5_SIZE                              0x1
#define _NVMADRL_NVMADRL5_LENGTH                            0x1
#define _NVMADRL_NVMADRL5_MASK                              0x20
#define _NVMADRL_NVMADRL6_POSN                              0x6
#define _NVMADRL_NVMADRL6_POSITION                          0x6
#define _NVMADRL_NVMADRL6_SIZE                              0x1
#define _NVMADRL_NVMADRL6_LENGTH                            0x1
#define _NVMADRL_NVMADRL6_MASK                              0x40
#define _NVMADRL_NVMADRL7_POSN                              0x7
#define _NVMADRL_NVMADRL7_POSITION                          0x7
#define _NVMADRL_NVMADRL7_SIZE                              0x1
#define _NVMADRL_NVMADRL7_LENGTH                            0x1
#define _NVMADRL_NVMADRL7_MASK                              0x80

